app/controllers/players_controller.rb

SELECT "teams".* FROM "teams"
SELECT "players".* FROM "players"
---
  def index
    @teams = Team.all
    @players = Player.all